def page1():
    pass
    #처음 시작 페이지
    #구성: 게임 제목, 배경, start버튼
    #액션: start버튼 누르면 page2로 

def page2():
    pass
    #종류 선택 페이지
    #구성: 꽃 종류(그림과 함께)
    #액션: 종류를 선택하면 page3으로

def page3():
    pass
    #키우는 방법 페이지
    #구성: 꽃 선택에 따른 조건 표시, 키보드를 이용하라는 설명 제시
    #액션: OK클릭하면 page4로

def page4():
    pass
    #본격적으로 키우는 페이지
    #구성: 꽃의 상태 나타내는 부분
          #게임 화면
          #거름, 물, 해 각각 숫자 표시 부분
          #게이지 표시부분
    #액션: 위에서 거름, 물, 해가 내려옴
          #평상시에는 게이지 1씩 감소
          #조건 만족 시 양분을 받으면 게이지 7씩 증가
          #조건 불만족 시 게이지 7씩 감소
          #게이지 정도에 따라 꽃 상태 변화
          #게이지 0이면 page5로, 게이지 100이면 page6으로

def page5():
    pass
    #게임오버 끝페이지
    #구성: 꽃이 아파하는 화면, finish/start 버튼
    #액션: finish 버튼 클릭->창 닫힘, start 버튼 클릭->page2로

def page6():
    pass
    #완성 끝페이지
    #구성: 꽃이 행복해하는 화면, finish/start 버튼
    #액션: finish 버튼 클릭->창 닫힘, start 버튼 클릭->page2로
